{
	"SERVER": "Server",
	"COMMENT_01": "Form data requests still not working",
	"TEXT_01": "The server is responsible for actually handling incoming requests, and delivering them back to the user. It has support for middlewares and providers.",
	"TITLE_01": "Usage",
	"COMMENT_02": "We are going to use Açai's router to control our routes, but you can easily overwrite this, will be shown next",
	"COMMENT_03": "Middlewares are optional",
	"TITLE_02": "Overwriting router",
	"TEXT_02": "If you do not wish to use our router, you can easily overwrite it:",
	"COMMENT_04": "File to load from the route match",
	"COMMENT_05": "Method to call inside of the file (optional)",
	"COMMENT_06": "Extra options, such as middleware, etc",
	"COMMENT_07": "Variables match from the dynamic route",
	"COMMENT_08": "Query params",
	"COMMENT_09": "Request body",
	"COMMENT_10": "Request files (in case of formdata)",
	"TEXT_03": "You can use this for example, if you wish to point all routes to a single frontend, in case of a SPA.",
	"TITLE_03": "Providers",
	"TEXT_04": "Providers are the main way to boot things in your application, helping you setup your application in an organized manner. You can read more about them in the application/providers section.",
	"COMMENT_11": "Do something",
	"TITLE_04": "Middlewares",
	"TEXT_05": "Middleware is a pipeline that runs before the request actually reaches your code, making changes to the request content, or even bailing it out. You can use them for authentication, validation or anything alike.",
	"COMMENT_12": "Aliased middleware",
	"COMMENT_13": "Grouped aliased middlewares",
	"COMMENT_14": "Global middlewares",
	"LIST_01": "Global middlewares will run in every request of your application",
	"LIST_02": "Aliased middleware are middlewares that you can call through your routes, for privileged requests, and such.",
	"TITLE_05": "Responses",
	"TEXT_06": "We provide you with a response utility method that can help you import files, return request status codes, etc. Remember that the server smart guesses from the response you are giving, turning json into actual json and etc.",
	"COMMENT_15": "Return this to the server to load a file from the project root",
	"COMMENT_16": "Change the response status code"
}