{
	"TITLE": "Simply delicious",
	"SHORT_DESCRIPTION": "Açaí is a framework that focuses on simplicity and extensebility, enabling you to work fast and build amazing application with incredible ease.",
	"DESCRIPTION": "Focused on being a easy to understand and fast to master. Açai.JS brings everything you like to the mix: extensions, freedom, speed and perfomance",
	"GETTING_STARTED": "Get started now",
	"ABOUT": "About",
	"FEATURES": "Features",
	"FEATURES_DESCRIPTION": "Bla bla blah",
	"DOWNLOADS": "people downloaded our packages already",
	"FEATURES_TITLE": "Why use AçaíJS",
	"FEATURE_01_TITLE": "Simple",
	"FEATURE_01_DESCRIPTION": "With a small learning curve and using only the best of each architecture, AçaíJS was made to be easy to understand, extend and deliver.",
	"FEATURE_02_TITLE": "Modular",
	"FEATURE_02_DESCRIPTION": "Have an idea to use something that fits your need better than the default modules? It's easy to build your entire application from scratch as building modules.",
	"FEATURE_03_TITLE": "Fast",
	"FEATURE_03_DESCRIPTION": "Build your applications fast, deliver them faster, and see them running even faster.",
	"FEATURE_04_TITLE": "Simple",
	"FEATURE_04_DESCRIPTION": "With a small learning curve and using only the best of each architecture, AçaíJS was made to be easy to understand, extend and deliver.",
	"CONTENT": "What's included",
	"PARTNERS": "Who is using Açaí",
	"CONTENT_01": "A simple agnostic router and route builder. Enables you to easily build routes for both back and frontend.",
	"CONTENT_02": "A server layer that handles requests, middlewares, globals and providers.",
	"CONTENT_03": "A data class that helps you bundle and distribute a single source of true through your application.",
	"CONTENT_04": "An adaptable query builder that allows you to easily switch between various database types.",
	"CONTENT_05": "Classes that contains various tools for validating, mutating and interacting with database tables.",
	"CONTENT_06": "A test suite that integrates with utility tools that easen your testing process.",
	"CONTENT_07": "Easily validate data coming from the request and filters it.",
	"CONTENT_08": "Extra utilities such as: presenters, base middlewares, and such.",
	"CONTENT_09": "Automatically generate files and deliver them inside your own application, such as controllers. You can even create your own and pass arguments.",
	"HIGHLIGHT_01_TITLE": "And what about the framework?",
	"HIGHLIGHT_01": "Açaí was born from the principle that everything should be easy, even programming. So our main goal was to make a simple framework that was easy to use, but did not sacrifice good practices, perfomance nor organization. You can have everything at your hand and exchange each and every part easily. But you may ask yourself right now, where this weird name I never heard of before?",
	"HIGHLIGHT_02_TITLE": "But what is Açaí?",
	"HIGHLIGHT_02": "Açaí is a typical fruit in Brazil that carn turn into a wonderful blend that brings tourists all over the world for it. It's pronounced /assai/ and it comes from a brailizian native language called tupi-guarani, and means \"fruit that cries\". But why we would ever choose such a name for this? First of all, it tastes wonderfully, second thing is that the original team responsible for creating this framework, are proud brazilians that want to share and spread our culture over the world. Third, we hopefully hope to integrate our alphabet into the web standard, since most of the places will require us to write acai."
}